keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/scu.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) 2018-2023, Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/
/**
 * \file     scu.h
 *
 * \brief    System Control Unit low level access library
 *
 * \version  V0.4.2
 * \date     28. Aug 2023
 *
 * \note This file violates [MISRA 2012 Rule 2.2, required], [MISRA 2012 Rule 11.1, required], [MISRA 2012 Rule 11.4, advisory], [MISRA 2012 Rule 11.6, required], [MISRA 2012 Rule 2.5, advisory], [MISRA 2012 Rule 8.7, advisory]
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** TS           T&S                                                           **
** JO           Julia Ott                                                     **
** BG           Blandine Guillot                                              **
** VO           Vanessa Ongaro                                                **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.2.0: 2018-02-13, TS:   Initial version of revision history              **
** V0.2.1: 2018-10-17, TS:   WDTREL, WDTWINB, WDTCON initialization corrected **
**                           MODPISEL3 initialization removed                 **
** V0.2.2: 2019-01-28, TS:   __STATIC_INLINE changed to INLINE                **
**                           Doxygen update                                   **
**                           Revision history moved from scu.c to scu.h       **
**                           SCU_EnterSleepMode, SCU_ClkInit,                 **
**                           SCU_EnterStopMode functions updated              **
**                           SCU_WDT_Start, SCU_WDT_Stop and SCU_WDT_Service  **
**                           functions added                                  **
**                           Added #ifndef UNIT_TESTING_LV2 condition in      **
**                           SCU_EnterSleepMode for testability               **
** V0.2.3: 2019-03-18, TS:   SCU_Init, SCU_ClkInit and SCU_EnterStopMode      **
**                           functions updated                                **
**                           SCU_WDT_Start, SCU_WDT_Stop, SCU_System_Clock_Sel**
**                           functions updated                                **
**                           VCO_BYP and OSC_DISC masks and initial values    **
**                           macros added                                     **
** V0.2.4: 2019-06-17, JO:   In SCU_ClkInit: Removed setting APCLK_SET to     **
**                           zero because this register is cleared by         **
**                           Hardware, updated comment                        **
**                           In SCU_Init: Removed unused initialization of    **
**                           SCU->MODPISEL3                                   **
**                           In SCU_EnterSleepMode: Set LIN to sleep mode     **
**                           only if the LIN module is enabled                **
** V0.2.5: 2020-03-02, BG:   Updated revision history format                  **
** V0.2.6: 2020-07-30, JO:   EP-426: Modified SCU_ClkInit to apply XTAL       **
**                           setting correctly (independent from compiler     **
**                           optimization)                                    **
** V0.2.7: 2020-08-10, JO:   Updated function SCU_ClkInit() to use internal   **
**                           oscillator instead of PLL output if configured   **
**                           in Config Wizard (define SCU_USE_PLL)            **
** V0.2.8: 2020-08-10, JO:   EP-429: Added function SCU_RecoverPllLossOfLock  **
** V0.2.9: 2020-12-04, JO:   EP-635: Corrected switching to LP_CLK in         **
**                           functions SCU_ClkInit and SCU_EnterStopMode      **
** V0.3.0: 2021-08-24, VO:   EP-825: Added clearing of GPIO_WAKE_STATUS when  **
**                           entering stop mode                               **
** V0.3.1: 2022-01-21, JO:   EP-934: Updated copyright and branding           **
** V0.4.0: 2023-06-30, JO:   EP-655: Removed PLL and related functions,       **
**                           Updated SCU_ClkInit                              **
** V0.4.1: 2023-08-21, BG:   EP-1195: Removed warning with ARMCC V6           **
** V0.4.2: 2023-08-28, JO:   EP-435: Removed ARMCC v6 compiler warnings       **
*******************************************************************************/

