keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/scu.h
#ifndef SCU_H
#define SCU_H

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "tle985x.h"
#include "types.h"
#include "sfr_access.h"
#include "bootrom.h"

/*******************************************************************************
**                          Global Macro Definitions                          **
*******************************************************************************/
/**\brief  PASSWD Phrases, PASSWD Opened */
#define PASSWD_Open (0x98U)
/**\brief  PASSWD Phrases, PASSWD Closed */
#define PASSWD_Close (0xA8U)

/**\brief  NVM Protection indices, BOOT */
#define NVM_PASSWORD_BOOT (0U)
/**\brief  NVM Protection indices, CODE */
#define NVM_PASSWORD_CODE (1U)
/**\brief  NVM Protection indices, DATA */
#define NVM_PASSWORD_DATA  (2U)

/**\brief  NVM Protection actions, CLEAR ACTION */
#define PROTECTION_CLEAR  (1U)
/**\brief  NVM Protection actions, SET ACTION */
#define PROTECTION_SET    (0U)

/**\brief  PBA0 Clock Divider, DIV1 */
#define PBA0_Div_1  (0U)
/**\brief  PBA0 Clock Divider, DIV2 */
#define PBA0_Div_2  (1U)

/**\brief  VCO_BYP MASK */
#define VCO_BYP_Msk  (0x80008U)
/**\brief  VCO_BYP Initial Value */
#define VCO_BYP_0    (0x80000U)
/**\brief  OSC_DISC MASK */
#define OSC_DISC_Msk (0x40004U)
/**\brief  OSC_DISC Initial Value */
#define OSC_DISC_0   (0x40000U)

/*******************************************************************************
**                           Global Type Definitions                          **
*******************************************************************************/
/** \enum TScu_Mod
 *  \brief This enum lists the SCU Modules Configuration.
 */
typedef enum
{
  Mod_ADC1 = 0x00,     /**< SCU Modules Select: ADC1 */
  Mod_SSC1 = 0x01,     /**< SCU Modules Select: SSC1 */
  Mod_CCU = 0x02,      /**< SCU Modules Select: CCU6 */
  Mod_Timer2 = 0x03,   /**< SCU Modules Select: Timer2 */
  Mod_GPT12 = 0x04,    /**< SCU Modules Select: GPT12 */
  Mod_SSC2 = 0x08,     /**< SCU Modules Select: SSC2 */
  Mod_Timer21 = 0x0A   /**< SCU Modules Select: Timer21 */
} TScu_Mod;

/** \enum TSCU_System_Clock
 *  \brief This enum lists the SCU System Clock Sources.
 */
typedef enum
{
  SCU_System_Clock_LP_CLK = 2, /**< SCU System Clock Source Select: LP Clock */
  SCU_System_Clock_IntOsc = 3  /**< SCU System Clock Source Select: Int Clock */
} TSCU_System_Clock;

/** \enum TSCU_VTOR
 *  \brief This enum lists the SCU Vector Table Relocation.
 */
typedef enum
{
  SCU_VTOR_ROM   = 0, /**< SCU Vector Table Relocation: ROM */
  SCU_VTOR_RAM   = 1, /**< SCU Vector Table Relocation: RAM */
  SCU_VTOR_CBSL  = 2, /**< SCU Vector Table Relocation: CBSL */
  SCU_VTOR_UCODE = 3  /**< SCU Vector Table Relocation: UCODE */
} TSCU_VTOR;

/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/
/** \brief Initializes the SCU module.
 *
 * \ingroup scu_api
 */
void SCU_Init(void);

/** \brief Initializes the system clocks.
 *
 * \ingroup scu_api
 */
void SCU_ClkInit(void);

/** \brief Sets the device into Sleep Mode
 * \note This function violates [MISRA 2012 Rule 2.2, required]
 *
 * performed steps:
 * Set LIN to sleep mode,
 * clear Main wake status and Wake Source MON Input,
 * stop WDT1 and trigger a short open window,
 * disable interrupts
 * set Sleep Mode Enable flag in Power Mode Control Register 0,
 * execute the WFE instruction twice to exter sleep mode
 *
 * \brief <b>Example</b><br>
 * \brief This example Sets the device into Sleep Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_EnterSleepMode();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
void SCU_EnterSleepMode(void);

/** \brief Sets the device into Stop Mode
 * \note This function violates [MISRA 2012 Rule 2.2, required]
 *
 * performed steps:
 * clear Main wake status and Wake Source MON Input,
 * stop WDT1 and trigger a short open window,
 * disable interrupts
 * select LP_CLK as sys clk for a defined state,
 * set Sleep Mode Enable flag in Power Mode Control Register 0,
 * execute the WFE instruction twice to exter sleep mode
 * + in case TLE985X doesn't wake up with a reset:
 * switch back fINTOSC (was set to LP_CLK before),
 * enable interrupts,
 * initialize WDT1
 *
 * \brief <b>Example</b><br>
 * \brief This example Sets the device into Stop Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_EnterStopMode();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
void SCU_EnterStopMode(void);

/** \brief Sets the Write/Read Protection for the Code/Data Flash
 *
 * \param Protection BOOT/CODE/DATA, see \link NVM_PASSWORD_SEGMENT_t \endlink
 * \param Action CLEAR/SET
 * \return ERR_LOG_SUCCESS or error code, see \link BOOTROM_RETURN_CODE_t \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example writes Protection for the Code Flash.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_ChangeNVMProtection(NVM_PASSWORD_CODE, PROTECTION_SET);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
int32_t SCU_ChangeNVMProtection(NVM_PASSWORD_SEGMENT_t Protection, uint8 Action);
	
/*******************************************************************************
**                        Inline Function Declarations                        **
*******************************************************************************/
/** \brief Disables a given peripheral module
 *
 * \param Module SCU Modules, see \link TScu_Mod \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example disables ADC1 Module.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_Disable_Module(Mod_ADC1);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_Disable_Module(TScu_Mod Module);

/** \brief Enables a given peripheral module
 *
 * \param Module SCU Modules, see \link TScu_Mod \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example enables ADC1 Module.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_Enable_Module(Mod_ADC1);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_Enable_Module(TScu_Mod Module);

/** \brief Starts the Watchdog of SCU-DM in the Watchdog Timer Control Register
 * The written bit is protected by the Bit Protection Register of SCU.
 *
 * \brief <b>Example</b><br>
 * \brief This example starts the internal Watchdog and services the internal Watchdog.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_WDT_Start();
 *   SCU_WDT_Service();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_WDT_Start(void);

/** \brief Stops the Watchdog of SCU-DM in the Watchdog Timer Control Register
 * The written bit is protected by the Bit Protection Register of SCU.
 *
 * \brief <b>Example</b><br>
 * \brief This example stops the internal Watchdog.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_WDT_Stop();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_WDT_Stop(void);

/** \brief Services the Watchdog of SCU-DM in the Watchdog Timer Control Register
 *
 * \brief <b>Example</b><br>
 * \brief This example starts the internal Watchdog and services the internal Watchdog.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_WDT_Start();
 *   SCU_WDT_Service();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_WDT_Service(void);

/** \brief Opens the bit protection by writing PASSWD_Open to the Bit Protection Register
 *
 * \brief <b>Example</b><br>
 * \brief This example opens the PASSWD Register protection scheme.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_OpenPASSWD();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_OpenPASSWD(void);

/** \brief Closes the bit protection by writing PASSWD_Close to the Bit Protection Register
 *
 * \brief <b>Example</b><br>
 * \brief This example closes the PASSWD Register protection scheme.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_ClosePASSWD();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_ClosePASSWD(void);

/** \brief Sets PBA0 Clock Divider.
 *
 * \param div PBA0 Clock Divider: 0 if div1, 1 if div2
 *
 * \brief <b>Example</b><br>
 * \brief This example sets The PBA0 Clock Divider to 2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_Sel_PBA0_Clk_Div_Sel(PBA0_Div_2);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_Sel_PBA0_Clk_Div_Sel(uint8 div);

/** \brief Selects a Vector Table Bypass Mode.
 *
 * \param a Vector Table Bypass Mode, see \link TSCU_VTOR \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example configures the VTOR to be remapped to RAM.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_VTOR_Sel(SCU_VTOR_RAM);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_VTOR_Sel(TSCU_VTOR a);

/** \brief Selects a System Clock.
 *
 * \param a System Clock, see \link TSCU_System_Clock \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example sets The clock output signal to fINTOSC.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_OpenPASSWD();
 *   SCU_System_Clock_Sel(SCU_System_Clock_IntOsc);
 *   SCU_ClosePASSWD();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_System_Clock_Sel(TSCU_System_Clock a);

