keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/scu.h
/** \brief Clears Analog Peripherals Clock 1 Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example clears Analog Peripherals Clock 1 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_APCLK1_Sts_Clr();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCU_APCLK1_Sts_Clr(void);

/** \brief Clears Analog Peripherals Clock 2 Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example clears Analog Peripherals Clock 2 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_APCLK2_Sts_Clr();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */         
INLINE void SCU_APCLK2_Sts_Clr(void);

/** \brief Clears Analog Peripherals Clock 3 Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example clears Analog Peripherals Clock 3 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCU_APCLK3_Sts_Clr();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */        
INLINE void SCU_APCLK3_Sts_Clr(void);     

/** \brief Enables Clock Watchdog.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Clock Watchdog.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_CLKWDT_PD_N_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */  
INLINE void SCUPM_CLKWDT_PD_N_En(void);

/** \brief Disables Clock Watchdog.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Clock Watchdog.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_CLKWDT_PD_N_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */    
INLINE void SCUPM_CLKWDT_PD_N_Dis(void);

/** \brief Sets Analog Module Clock 1 Upper Limit Threshold.
 *
 * \param thld Upper Limit Threshold
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 1 Upper Limit Threshold to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK1_UP_TH_Set(0x3F);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK1_UP_TH_Set(uint8 thld);

/** \brief Sets Analog Module Clock 1 Upper Hysteresis.
 *
 * \param hyst Upper Hysteresis
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 1 Upper Hysteresis to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK1_UP_HYS_Set(0x3);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK1_UP_HYS_Set(uint8 hyst);

/** \brief Sets Analog Module Clock 1 Lower Limit Threshold.
 *
 * \param thld Lower Limit Threshold
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 1 Lower Limit Threshold to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK1_LOW_TH_Set(0x3F);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK1_LOW_TH_Set(uint8 thld);

/** \brief Sets Analog Module Clock 1 Lower Hysteresis.
 *
 * \param hyst Lower Hysteresis
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 1 Lower Hysteresis to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK1_LOW_HYS_Set(0x3);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK1_LOW_HYS_Set(uint8 hyst);

/** \brief Sets Analog Module Clock 2 Upper Limit Threshold.
 *
 * \param thld Upper Limit Threshold
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 2 Upper Limit Threshold to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK2_UP_TH_Set(0x3F);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK2_UP_TH_Set(uint8 thld);

/** \brief Sets Analog Module Clock 2 Upper Hysteresis.
 *
 * \param hyst Upper Hysteresis
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 2 Upper Hysteresis to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK2_UP_HYS_Set(0x3);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK2_UP_HYS_Set(uint8 hyst);

/** \brief Sets Analog Module Clock 2 Lower Limit Threshold.
 *
 * \param thld Lower Limit Threshold
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 2 Lower Limit Threshold to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK2_LOW_TH_Set(0x3F);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK2_LOW_TH_Set(uint8 thld);

/** \brief Sets Analog Module Clock 2 Lower Hysteresis.
 *
 * \param hyst Lower Hysteresis
 *
 * \brief <b>Example</b><br>
 * \brief This example sets Analog Module Clock 2 Lower Hysteresis to Maximum value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   SCUPM_AMCLK2_LOW_HYS_Set(0x3);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void SCUPM_AMCLK2_LOW_HYS_Set(uint8 hyst);

/** \brief Selects low power deep sleep mode.
 *
 * \brief <b>Example</b><br>
 * \brief This example selects low power deep sleep mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   CPU_DeepSleep_Sel();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */
INLINE void CPU_DeepSleep_Sel(void);

/** \brief Selects entering sleep or deep sleep on exit.
 *
 * \brief <b>Example</b><br>
 * \brief This example selects entering deep sleep on exit.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   CPU_DeepSleep_Sel();  
 *   CPU_SleepOnExit_Sel();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup scu_api
 */  
INLINE void CPU_SleepOnExit_Sel(void);

/*******************************************************************************
**                         Inline Function Definitions                        **
*******************************************************************************/
INLINE void SCU_Disable_Module(TScu_Mod Module)
{
  Field_Mod32(&SCU->PMCON.reg, (uint8)Module, (uint32)1u << (uint8)Module, 1u);  
}

INLINE void SCU_Enable_Module(TScu_Mod Module)
{
  Field_Mod32(&SCU->PMCON.reg, (uint8)Module, (uint32)1u << (uint8)Module, 0u);  
}

INLINE void SCU_WDT_Start(void)
{
  SCU_OpenPASSWD();	
  Field_Mod32(&SCU->WDTCON.reg, (uint8)SCU_WDTCON_WDTEN_Pos, SCU_WDTCON_WDTEN_Msk, 1u);
	SCU_ClosePASSWD();
}

INLINE void SCU_WDT_Stop(void)
{
  SCU_OpenPASSWD();	
  Field_Mod32(&SCU->WDTCON.reg, (uint8)SCU_WDTCON_WDTEN_Pos, SCU_WDTCON_WDTEN_Msk, 0u);
	SCU_ClosePASSWD();
}

INLINE void SCU_WDT_Service(void)
{
  Field_Mod32(&SCU->WDTCON.reg, (uint8)SCU_WDTCON_WDTRS_Pos, SCU_WDTCON_WDTRS_Msk, 1u);
}

INLINE void SCU_OpenPASSWD(void)
{
  Field_Wrt32all(&SCU->PASSWD.reg, (uint8)PASSWD_Open);  
}

INLINE void SCU_ClosePASSWD(void)
{
  Field_Wrt32all(&SCU->PASSWD.reg, (uint8)PASSWD_Close);
}

