keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/scu.h
INLINE void SCU_Sel_PBA0_Clk_Div_Sel(uint8 div)
{
  SCU_OpenPASSWD();
  Field_Wrt32(&SCU->CMCON2.reg, (uint8)SCU_CMCON2_PBA0CLKREL_Pos, SCU_CMCON2_PBA0CLKREL_Msk, div);
  SCU_ClosePASSWD();  
}

INLINE void SCU_VTOR_Sel(TSCU_VTOR a)
{
  SCU_OpenPASSWD();
  Field_Wrt32(&SCU->VTOR.reg, (uint8)SCU_VTOR_VTOR_BYP_Pos, SCU_VTOR_VTOR_BYP_Msk, (uint32)a);
  SCU_ClosePASSWD();
}

INLINE void SCU_System_Clock_Sel(TSCU_System_Clock a)
{
  SCU_OpenPASSWD();	
  Field_Mod32(&SCU->SYSCON0.reg, (uint8)SCU_SYSCON0_SYSCLKSEL_Pos, SCU_SYSCON0_SYSCLKSEL_Msk, (uint32)a);
  SCU_ClosePASSWD();	
}

INLINE void SCU_APCLK1_Sts_Clr(void)         
{
  Field_Wrt32(&SCU->APCLK_SCLR.reg, (uint8)SCU_APCLK_SCLR_APCLK1SCLR_Pos, SCU_APCLK_SCLR_APCLK1SCLR_Msk, 1);
}

INLINE void SCU_APCLK2_Sts_Clr(void)                     
{
  Field_Wrt32(&SCU->APCLK_SCLR.reg, (uint8)SCU_APCLK_SCLR_APCLK2SCLR_Pos, SCU_APCLK_SCLR_APCLK2SCLR_Msk, 1);
}

INLINE void SCU_APCLK3_Sts_Clr(void)                     
{
  Field_Wrt32(&SCU->APCLK_SCLR.reg, (uint8)SCU_APCLK_SCLR_APCLK3SCLR_Pos, SCU_APCLK_SCLR_APCLK3SCLR_Msk, 1);
}

INLINE void SCUPM_CLKWDT_PD_N_En(void)                      
{
  Field_Wrt32(&SCUPM->AMCLK_CTRL.reg, (uint8)SCUPM_AMCLK_CTRL_CLKWDT_PD_N_Pos, SCUPM_AMCLK_CTRL_CLKWDT_PD_N_Msk, 1);
}

INLINE void SCUPM_CLKWDT_PD_N_Dis(void)                      
{
  Field_Wrt32(&SCUPM->AMCLK_CTRL.reg, (uint8)SCUPM_AMCLK_CTRL_CLKWDT_PD_N_Pos, SCUPM_AMCLK_CTRL_CLKWDT_PD_N_Msk, 0);
}

INLINE void SCUPM_AMCLK1_UP_TH_Set(uint8 thld)                 
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK1_UP_TH_Pos, SCUPM_AMCLK_TH_HYS_AMCLK1_UP_TH_Msk, thld);
}

INLINE void SCUPM_AMCLK1_UP_HYS_Set(uint8 hyst)                
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK1_UP_HYS_Pos, SCUPM_AMCLK_TH_HYS_AMCLK1_UP_HYS_Msk, hyst);
}

INLINE void SCUPM_AMCLK1_LOW_TH_Set(uint8 thld)                
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_TH_Pos, SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_TH_Msk, thld);
}

INLINE void SCUPM_AMCLK1_LOW_HYS_Set(uint8 hyst)               
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_HYS_Pos, SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_HYS_Msk, hyst);
}

INLINE void SCUPM_AMCLK2_UP_TH_Set(uint8 thld)                 
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK2_UP_TH_Pos, SCUPM_AMCLK_TH_HYS_AMCLK2_UP_TH_Msk, thld);
}

INLINE void SCUPM_AMCLK2_UP_HYS_Set(uint8 hyst)                
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK2_UP_HYS_Pos, SCUPM_AMCLK_TH_HYS_AMCLK2_UP_HYS_Msk, hyst);
}

INLINE void SCUPM_AMCLK2_LOW_TH_Set(uint8 thld)                
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_TH_Pos, SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_TH_Msk, thld);
}

INLINE void SCUPM_AMCLK2_LOW_HYS_Set(uint8 hyst)               
{
  Field_Mod32(&SCUPM->AMCLK_TH_HYS.reg, (uint8)SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_HYS_Pos, SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_HYS_Msk, hyst);
}

INLINE void CPU_DeepSleep_Sel(void)                          
{
  Field_Mod32(&CPU->SCR.reg, (uint8)CPU_SCR_SLEEPDEEP_Pos, CPU_SCR_SLEEPDEEP_Msk, 1);
}

INLINE void CPU_SleepOnExit_Sel(void)                        
{
  Field_Mod32(&CPU->SCR.reg, (uint8)CPU_SCR_SLEEPONEXIT_Pos, CPU_SCR_SLEEPONEXIT_Msk, 1);
}

#endif
